[
    {
        "name": "transfoodbeverage.com",
        "url": "post/U9jdJY31DE5g4WnQtufNxdWiF",
        "description": "Trans F&B is a subsidiary of Trans Corp which is engaged in Food & Beverages (Food & Beverage)\n\nOur company brand Baskin Robbins, Coffee Bean, Wendy's, Tasty, Gyukatsu, Wardani, Meatballs Duren Three"
    },
    {
        "name": "argofinance.org",
        "url": "post/U47L9H0AWyz22CIm2xrthX5l6",
        "description": "We are an investment company, using blockchain technology to drive secure and profitable investments and manage portfolios for our clients."
    },
    {
        "name": "avans.com",
        "url": "post/PyHwkwKII6hxl62UVZBC2zkIx",
        "description": "Ofrecemos soluciones de acceso, control de flujo peatonal y transportación vertical para todo tipo de edificios."
    },
    {
        "name": "pingan.com",
        "url": "post/hsTX4xvV7ne7XkfZZmZhPzFSk",
        "description": "Ping An is a China-based conglomerate that owns and operates businesses in fields such as banking, insurance, asset management and healthcare services."
    },
    {
        "name": "healthyuturn.in",
        "url": "post/jM913CI5bt743N8QNKcXHaZS4",
        "description": "At Healthy U turn, we specialize in providing tailored dietary plans and expert guidance to help you navigate diabetes with confidence."
    },
    {
        "name": "yassir.com",
        "url": "post/18c6fEKFR316FnGh10eMkNbiW",
        "description": "Yassir is a super app for ride-hailing, food delivery, and grocery shopping, offering convenience and safety with transparent pricing. Trusted by over 5 million users, it simplifies your daily life."
    },
    {
        "name": "seoulpi.io",
        "url": "post/3j4BNnOF7SEY4sO2aeggZSaMq",
        "description": "Seoul Property Insight (SPI) is a prominent player in the South Korean real estate sector, dedicated to providing comprehensive insights and analysis on commercial real estate investments."
    },
    {
        "name": "betterhalf.ai",
        "url": "post/3myg3hnjNB7gdvT8UnUf8ycMt",
        "description": "The Wedding Company is India's largest end-to-end wedding planning service provider. They offer comprehensive solutions for couples planning their nuptials. The Wedding Company leverages its industry expertise and extensive partner network to deliver stress-free, personalized wedding experiences."
    },
    {
        "name": "bbgc.gov.bd",
        "url": "post/0Y0x6qpul6Dn12r1CXoCupkNz",
        "description": "The importance of education in building a prosperous nation is immense. Late Shamsul Haque MP established the school in 1973 with the aim of spreading the light of education."
    },
    {
        "name": "itap.nacc.go.th",
        "url": "post/s6w8e7NMjAHtl2rCBtiE5zKPu",
        "description": "The Integrity and Transparency Assessment of Public Service (ITAP) is an initiative by the National Anti-Corruption Commission (NACC) aimed at evaluating the ethical standards and transparency of government agencies across Thailand."
    },
    {
        "name": "porter.in",
        "url": "post/Mi2ATh7NhCvpB9DlhlwMq5vv6",
        "description": "Porter is a tech-enabled logistics company that provides a comprehensive range of delivery services, including intracity and intercity solutions."
    },
    {
        "name": "poorvika.com",
        "url": "post/VlhzvOu5MiF2PCjG816wq1RdY",
        "description": "Poorvika Mobiles Private Ltd is a company that operates in the Consumer Electronics & Computers Retail industry."
    },
    {
        "name": "nfe.fazenda.gov.br",
        "url": "post/4rkKjAfcP0Q8PinmhNcpa0oXL",
        "description": "The NF-e Portal aims to provide information about the Electronic Invoice (Nota Fiscal Eletrônica), coordinated by ENCAT and developed in partnership with the Federal Revenue of Brazil. Its purpose is to transition from paper invoices to electronic invoices, which have legal validity for all purposes."
    }
]