[
    {
        "company": "Nova Sinseg",
        "time": "2024-09-24T08:40:53+00:00",
        "description": "Novasinseg.com.br Nova Sinseg is a company that operates in the Consumer Services industry. It employs 20to49 people and has 1Mto5M of revenue. The company is headquartered in Americana, Brazil."
    },
    {
        "company": "Solutii Sistemas",
        "time": "2024-09-24T08:40:50+00:00",
        "description": "Solutii.com.br Solutii Sistemas is a borderless Information Technology company, offering ERP Microsiga Protheus (TOTVS S/A®) consulting, consulting and advisory services in business rules, systems development, Protheus customization, Protheus and IT support. A company that was born supported by the solid knowledge of its founders in technology."
    },
    {
        "company": "Partners Air",
        "time": "2024-09-24T08:35:10+00:00",
        "description": "Partners Air is a company that operates in the Commercial & Residential Construction industry. It employs 10to19 people and has 1Mto5M of revenue. The company is headquartered in Brazi ."
    },
    {
        "company": "Frigocenter",
        "time": "2024-09-24T08:35:02+00:00",
        "description": "Frigocenter.com.br Frigocenter is a company that operates in the Office Products Retail & Distribution industry. It employs 20to49 people and has 1Mto5M of revenue. The company is headquartered in Sao Bernardo do Campo, Sao Paulo, Brazil ."
    },
    {
        "company": "Emtel",
        "time": "2024-09-15T15:09:14+00:00",
        "description": "https://www.emtel.com Emtel is a leading telecommunications company based in Mauritius, offering a comprehensive suite of telecom services. With a strong track record of innovation and industry firsts, Emtel Ltd has consistently pushed the boundaries of technology and service. The company’s investments in the METISS cable, data centers, 5G network, Fintech and the first satellite ground station in Mauritius, in partnership with OneWeb, demonstrate its commitment to staying at the forefront of the telecom industry. Emtel’s focus on innovation,  customer satisfaction , and shareholder value creation makes it an attractive opportunity for investors seeking growth and returns in the dynamic telecom sector. Emtel is committed to playing a key role in building a smarter future for Mauritius, Rodrigues and Agalega, a future where positive economic, environmental and societal outcomes are powered by technology."
    },
    {
        "company": "UNI-PA A.Ş",
        "time": "2024-09-14T23:51:38+00:00",
        "description": "www.unipa.com.tr"
    },
    {
        "company": "Like Family’s",
        "time": "2024-09-14T23:50:23+00:00",
        "description": "www.likefamilypr.com Like Family is a Puerto Rican company that dedicates its efforts to care for people at home since 2005 in all the municipalities of Puerto Rico, including Vieques and Culebra. Currently, we have about 500 housekeepers offering direct services to participants, and we have a team of 20 people in the Central Office, located in the town of Aibonito."
    },
    {
        "company": "Rextech",
        "time": "2024-09-14T23:50:16+00:00",
        "description": "Rextech can handle all the company’s IT needs. We offer qualified IT advice to small and medium-sized companies, and we cover the whole of Denmark. We can help you with everything from server installations to financial systems and service agreements to hosting. At the same time, we can offer a high level of service, personal service and low prices."
    },
    {
        "company": "Gino Giglio Generation Spa",
        "time": "2024-09-14T23:50:01+00:00",
        "description": "gigliospa.com Gino Giglio Generation Spa – Il Mondo della Cartoleria is a company that operates in the Office Products Retail & Distribution industry. It employs 10to19 people and has 1Mto5M of revenue. The company is headquartered in Nola, Campania, Italy."
    },
    {
        "company": "Announcement 9-14",
        "time": "2024-09-14T23:40:02+00:00",
        "description": "Hey ,  With decision of Admins Since month ago,  Arcus project had a break for week and been working under shadows since then . We been Updating and Reconfigure our infrastructure to keep this Project Live and Safe and today we will continue Project like before. Affiliation Meanwhile we receive lot of messages that asks for affiliation program , Arcus is Invite only Project and not everyone can invite another person, Affiliation Invitation is based on ranking in our network. We aware some other projects has Pay to Use service but we did not offer same, Since today If you think you cant find right connection to join Arcus , We can offer something like Others but read Program situation Carefully : With Depositing 20k , you will get contact with one of affiliates and can provide your access on targets to them Under this terms : 1- Target Revenue > 20m$. 2- Affiliates has rights to flag it as Honeypot and Close your request . 3- Access must explained . You will get your deposit back After First Payment, After making 50kUSD Profit you will get rank as newcomer and access Payloads yourself. Bug bounty Program (Affiliates only): Identity Leakage of Affiliates & Administration : High root in Servers : High Limited Access to servers : Medium Bugs on Payloads, tools : Low – Medium IP leakage of Servers & Affiliates & Administration : Low High +20K medium 5-20K Low 1-5K"
    },
    {
        "company": "Doodle Tech",
        "time": "2024-07-20T13:14:45+00:00",
        "description": "https://doodletech.ae With our unique blend of expertise, services and products portfolio, we can design, implement and support end to end solution for your organization. Therefore Doodle technologies is the best choice for organizations looking for a dependable IT partner that can provide complete solutions. We are a full bloom IT services company delivering services essentially in Cloud, Web, Digital marketing, and IT service in MiddleEast. Our team of experienced professionals backs us up to award the finest service to our clients exceeding their satisfaction. We focus on assuring comprehensive IT solutions and creative assistance for businesses regardless of their size, type or target audience. We have emerged as one of the trusted development and support companies in UAE over the years of experience."
    },
    {
        "company": "Freightliner of Grand Rapids & Kalamazoo",
        "time": "2024-06-29T15:52:16+00:00",
        "description": "https://www.ftlgr.com"
    },
    {
        "company": "Clima Lodi",
        "time": "2024-06-29T15:51:11+00:00",
        "description": "https://www.climalodi.com"
    },
    {
        "company": "Total Revisjon DA",
        "time": "2024-06-26T16:53:47+00:00",
        "description": "Totalrevisjon.no"
    },
    {
        "company": "GED Lawyers",
        "time": "2024-06-26T16:47:28+00:00",
        "description": "Gedlawyers.com"
    },
    {
        "company": "BankSelfStorage",
        "time": "2024-06-20T10:52:25+00:00",
        "description": "We offer personal and business storage solutions for customers all over Greater Manchester, including Bolton, Oldham and Rochdale."
    },
    {
        "company": "Exhaustpro shops",
        "time": "2024-06-20T10:52:17+00:00",
        "description": "This female owner and her partners have been a trusted name in central Kentucky since 1986. Locally owned and operated, we actually manage our own service centers. From routine maintenance to major repairs, we solve your auto problems with professional service and convenience at an affordable cost.Our certified technicians provide an honest assessment of your auto’s service repair. We diagnose and fix nearly every problem on nearly every make and model of vehicle, foreign and domestic."
    },
    {
        "company": "WinFashion ERP",
        "time": "2024-06-11T15:25:30+00:00",
        "description": "WinFashion is an international company supplying ERP software to many Fashion companies across the globe. The company was founded in 1994 in Los Angeles, California and since then it has opened offices in New York, China, and India. We currently have over 250+ fashion companies using WinFashion to manage their daily business, including order processing, manufacturing, sourcing, and accounting."
    },
    {
        "company": "Immediate Transport – UK",
        "time": "2024-06-03T23:32:36+00:00",
        "description": "Immediatetransport.com Immediate Transportation Co. is a privately owned freight forwarding and logistics company that has been in business for over 100 years."
    },
    {
        "company": "Botselo",
        "time": "2024-06-03T22:31:45+00:00",
        "description": "Botselo.co.za"
    },
    {
        "company": "BHMAC",
        "time": "2024-06-03T22:31:39+00:00",
        "description": "Bhmac is a company that operates in the Mining & Metals industry. It employs 101-250 people and has $25M-$50M of revenue. The company is headquartered in Croatia, they are supported by EU ."
    },
    {
        "company": "Duque Saldarriaga",
        "time": "2024-06-03T22:30:49+00:00",
        "description": "We are a marketing company, established in 1982, oriented to the supply of plastic and glass containers for all types of uses. We are a marketing company, established in 1982, oriented to the supply of plastic and glass containers for all types of uses."
    },
    {
        "company": "Franja IT Integradores de Tecnología",
        "time": "2024-06-03T22:30:27+00:00",
        "description": "Franja IT is a company that is based on its experience, accumulated for more than fifteen years, carrying out systematization projects and infrastructure improvements in multiple companies, helping to improve the day-to-day operations of companies that make good use of the technology have increased their competitiveness, productivity and safety, We really recommend them to protect your company ."
    },
    {
        "company": "Langescheid GbR",
        "time": "2024-06-03T22:30:26+00:00",
        "description": "your traditional logistic partner from Germany. As experienced transport enterprise we work as carriers for many large European forwarding businesses and accomplish in their order of transportation in the suburban traffic, in national long-distance traffic as well as in the international traffic. We furnish a part of our services by transports of sea-containers from the west North Sea ports Antwerpen and Rotterdam, whereby we possess the possibility by the use of modern container chassis and taking up containers of all sizes and tail-concisely to racks. The moreover are in our vehicle park articulated towing vehicles, and 13,6m curtain semitrailer naturally with quality the Edscha products equipped! If you should be able to include other pulled units into your arrangement better, we are to be adapted naturally our vehicle park to your individual desires. We are pleased about your interest and your inquiry"
    },
    {
        "company": "Colégio Nova Dimensão",
        "time": "2024-05-18T13:07:14+00:00",
        "description": "colegiond.com.br"
    },
    {
        "company": "Egyptian Sudanese",
        "time": "2024-05-16T00:00:18+00:00",
        "description": "Egyptiansudanese.com"
    },
    {
        "company": "RIO TECHNOLOGY",
        "time": "2024-05-16T00:00:03+00:00",
        "description": "Riotechnology.com.co"
    },
    {
        "company": "Grupo SASMET",
        "time": "2024-05-11T00:00:51+00:00",
        "description": "Grupo SASMET is a company that operates in the Health, Wellness and  Fitness industry. It employs 51-100 people and has $1M-$5M of revenue.  The comp any is headquartered in Manaus, Amazonas, Brazil. https://br.linkedin.com/company/sasmetsaude"
    },
    {
        "company": "GOLD RH S.A.S",
        "time": "2024-05-11T00:00:51+00:00",
        "description": "Goldrh.com.co Gold RH is a company with more than 10 years working in the area of ​​human resources. They specialize in carrying out outsourced or outsourcing processes for various sectors, both public and private. They cover a wide range of areas, such as manufacturing, operations, administration, management, support and sales."
    },
    {
        "company": "Frigrífico Boa Carne",
        "time": "2024-05-11T00:00:33+00:00",
        "description": "Frigboacarne.com.br  The BOA CARNE Refrigerator was designed by professionals with more than 30 years of activity in the meat market. Built in 2018 to be one of the most modern and technological industrial plants in Brazil, it began its activities in March 2020 with the aim of serving its customers with quality products and service that exceeds expectations whether in the domestic or foreign market. The company is strategically located in the State of Mato Grosso with distribution points in São Paulo and serves most Brazilian states. With a global and national logistics structure, it guarantees competitiveness, agility and punctuality, in the national and international market, with a presence in several countries around the world, South America, the Middle East, Africa, Asia and Europe In addition to the investment made in one of the most modern plants in Brazil, Frigorifico BOA CARNE, it continues to invest daily in improvements in automation, technologies, quality control and people. With a production capacity of 110,000 tons per year, Frigorifico BOA CARNE generates more than 600 direct jobs and aims to double its production by 2024. Frigorific BOA CARNE’s main goal is to have excellence throughout the production chain, in the treatment of its employees, in the traceability and sustainable origin of its livestock, in the quality of its product, all of this combined with excellent service to its customers in Brazil and in the world."
    },
    {
        "company": "Cusat",
        "time": "2024-05-11T00:00:28+00:00",
        "description": "Cusat.com.ar"
    },
    {
        "company": "FILSCAP",
        "time": "2024-05-11T00:00:16+00:00",
        "description": "Filscap.com.ph : Filipino Society of Composers, Authors and Publishers."
    },
    {
        "company": "Thibabem Atacadista",
        "time": "2024-05-11T00:00:04+00:00",
        "description": "Thibabem.com.br"
    },
    {
        "company": "Braz Assessoria Contábil",
        "time": "2024-05-11T00:00:00+00:00",
        "description": "Brazcontabil.com.br Braz Assessoria Contábil is a company committed to its clients since its foundation, with professionals with more than 35 years of experience in the accounting, tax, personal and tax sectors. Braz Assessoria Contábil is a company committed to its customers and capable of ensuring that their data and information will always be safe and protected by our privacy policy, which is fully based on the LGPD (General Data Protection Law, 13.709/2018)"
    },
    {
        "company": "BRAZIL GOV",
        "time": "2024-05-08T00:01:57+00:00",
        "description": "Santoantoniodapatrulha.rs.gov.br : City Hall of Santo Antônio da Patrulha No Description needed . We just get tired of being in their boxes, Thanks Brazil Gov."
    }
]