[
    {
        "time": "Sep 09, 2024 07:09:29",
        "country": "US",
        "website": "www.seaeng.com",
        "revenue": "14.4M",
        "industry": "Architecture, Engineering & Design",
        "description": "tahly Engineering & Associates, Inc. was established in 1970. The firm is headquartered in Helena, Montana with a branch office in Bozeman, Montana. Employees provide service in the fields of transportation engineering, water and wastewater planning and system development, civil site development, and structural engineering.  The total size of stolen information is 1.2Tb"
    },
    {
        "time": "Aug 24, 2024 00:08:48",
        "country": "US",
        "website": "mmtransport.com",
        "revenue": "28.2M",
        "industry": "Logistics",
        "description": "M&M Transport Services, Inc. was founded in 1990 by Mark R. Warsofsky and has steadily grown into a nationwide, dedicated transportation provider f or some of the biggest retail, manufacturing, distribution and logistics companies in the country.  The total size of stolen information is 868Gb."
    },
    {
        "time": "Aug 19, 2024 09:08:26",
        "country": "US",
        "website": "www.dunnsolutions.com",
        "revenue": "36.1M",
        "industry": "Business Services",
        "description": "Dunn Solutions Group is a digital commerce and business transformation consultancy that helps its clients achieve speed by automation. Acquisitions & Subsidiaries: Kaar Technologies.The total size of stolen information is 1.12Tb"
    },
    {
        "time": "Jul 07, 2024 09:07:22",
        "country": "USA",
        "website": "promarkbrands.com",
        "revenue": "$11.6M",
        "industry": "Consumer Services",
        "description": "Leading manufacturer and distributor of a complete line of pro and semi-pro photo, video and audio equipment and accessories based in the Chicago S Uburbs in a modern 100,000 sq ft facility, promarks 14 brands lead the industry in products and accessories the photo, video and audio industries depend on we pride ourselves on providing quality products, quick order fulfillment, experienced customer care, regional sales support and complete product service is the leading manufacturer and distributor  of equipment and accessories for the pro and semi-pro photo, video and audio industries. Our brands include Cool-Lux, Dot Line, Logan, Norman, OmegaBrandess, Photogenic, Photoflex, Quantum Instruments, Radiopopper, Smith-Victor, Speedotron, Lumedyne, Mola, and Na.\r\nThe total size of stolen information is 1.45TB"
    },
    {
        "time": "Jun 27, 2024 12:06:00",
        "country": "USA",
        "website": "fifcousa.com",
        "revenue": "$310.6M",
        "industry": "Wineries & Breweries",
        "description": "Founded in 2009, FIFCO USA, owns and operates breweries and retail locations in New York, Vermont, Oregon, and Washington. Their headquarters is inRochester, New York.\r\nSubsidiaries and affiliates: Labbat USA, North American Breweries, Genessee Brewing Company, Magic Hat Brewing Company, Pyramid Breweries, Portland Brewing.\r\nThe total size of stolen information is 7.09TB."
    },
    {
        "time": "Jun 02, 2024 16:06:35",
        "country": "US",
        "website": "s-f-concrete.com",
        "revenue": "$30.9M",
        "industry": "Commercial & Residential Construction",
        "description": "S&F Concrete Contractors, Inc. is committed to being an industry leader in safety and health by setting agressive goals and continually measuring our performance. We will continually work to achieve a workplace free from safety and health hazards and in full compliance with Federal, State and Local directives. The total size of stolen information is 1 TB."
    },
    {
        "time": "Jun 07, 2024 20:06:10",
        "country": "USA",
        "website": "college-park.com",
        "revenue": "$22.4M",
        "industry": "Medical Devices & Equipment",
        "description": "College Park Industries is a prosthetics manufacturing company. It design and manufacture a full line of anatomically correct, customizable prosthetic foot systems, upper limb solutions, endoskeletal components and MetroLiner gel products.  The total size of stolen information is 4.97 TB."
    },
    {
        "time": "May 18, 2024 15:05:40",
        "country": "USA",
        "website": "neosmteam.com",
        "revenue": "$15M",
        "industry": "Healthcare",
        "description": "Northeast Orthopedics and Sports Medicine is a company that operates in the Hospital & Health Care industry. The total size of stolen information is 1.56TB."
    },
    {
        "time": "May 18, 2024 15:05:40",
        "country": "USA",
        "website": "glenwoodnyc.com",
        "revenue": "$49.1M",
        "industry": "Real estate",
        "description": "Glenwood Management is a property management company, providing luxury apartments throughout New York. The total size of stolen information is 1.78TB."
    },
    {
        "time": "May 17, 2024 10:05:53",
        "country": "USA",
        "website": "iiexperts.com",
        "revenue": "$5M",
        "industry": "Software",
        "description": "Information Integration Experts, LLC (iiExperts aka IIX) has been developing software since the early 1970s. \r\nHeadquartered in Arlington, Texas, IIXbegan operations in 1980, and has been serving the Title Insurance industry since 1998 by providing high quality software and related services. The total size of stolen information is 1043GB. This leak contains corporate information of the company: SRC, DBs, office docs, scans, credentials for local and remote services, information on employees and partners, personal data of clients."
    },
    {
        "time": "May 17, 2024 09:05:43",
        "country": "USA",
        "website": "ekiconsult.com",
        "revenue": "$14.5 M",
        "industry": "Architecture, Engineering & Design",
        "description": "The total size of stolen information is 1TB. This leak contains corporate information of the company: Financial, legal, information on employees and partners. Information on clients was also received: Personal data of clients, all signed contracts and transactions, legal information of clients."
    },
    {
        "time": "Apr 21, 2024 13:04:01",
        "country": "US",
        "website": "semilab.com",
        "revenue": "$16.8M",
        "industry": "Electronics",
        "description": "The total size of stolen information is 1.47TB. This leak contains corporate information of the company: Financial, legal, information on employees, partners and clientsб drawingы and scheme of constructions."
    },
    {
        "time": "Apr 18, 2024 14:04:54",
        "country": "US",
        "website": "allenblastingandcoating.com",
        "revenue": "$20M",
        "industry": "Specialty Trade Contractors",
        "description": "The total size of stolen information is 1TB. This leak contains corporate information of the company: Financial, legal, information on employees, partners and clients."
    },
    {
        "time": "Apr 12, 2024 14:04:54",
        "country": "USA",
        "website": "ueg1.com",
        "revenue": "$9.2M",
        "industry": "Insurance",
        "description": "The total size of stolen information is 300GB. This leak contains customer data, corporate information, databases, employee data, and customer insurance."
    },
    {
        "time": "Apr 29, 2024 14:04:54",
        "country": "USA",
        "website": "fightingforfairness.com",
        "revenue": "$5.6M",
        "industry": "Law Firms & Legal Services",
        "description": "The total size of stolen information is 6 TB. This leak contains corporate information of the company: Financial, legal, medical information of clients and employees, personal data employees, partners and clients."
    },
    {
        "time": "Apr 08, 2024 14:04:54",
        "country": "USA",
        "website": "theblakefirm.com",
        "revenue": "<$5M",
        "industry": "Law Firms & Legal Services",
        "description": "The total size of stolen information is 740 GB. This leak contains corporate information of the company: Financial, legal, information on employees and partners. Information on clients was also received: Personal data of clients, all signed contracts and transactions."
    },
    {
        "time": "Apr 07, 2024 09:04:10",
        "country": "USA",
        "website": "pedsurology.com",
        "revenue": "$45M",
        "industry": "Hospitals & Physicians Clinics",
        "description": "The total size of stolen information is 740 GB. This leak contains corporate information of the company: Financial, legal, information on employees and partners. Information on clients was also received: Personal data of clients and employees."
    }
]